---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ContentDocTreeCorruption
source: html/30b0009c-ac47-8833-01a0-b98b27238c9c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ContentDocTreeCorruption Property

Problems with the Content Doc Tree structure - e.g. orphaned Content Docs, Families w/o docs, missing Owner Fam, what-not

## Syntax (C#)
```csharp
public static FailureDefinitionId ContentDocTreeCorruption { get; }
```